10/data/attachments/c0365d87297407b8.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_9b1ce4c2-2a42-47a3-b9d3-0b12bb702a03</nif:username>
            <nif:friendToBeAdded>Charles_loss_Actions_20247_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>